/* A 31 - SUBQUERIES */

/* QUEM VENDEU MAIS QUE O VALOR MÉDIO DE FEVEREIRO */

SELECT NOME, MIN(MARÇO) AS MIN_MARÇO
FROM VENDEDORES;

+--------+------------+
| NOME   | MIN_MARÇO  |
+--------+------------+
| CARLOS |    4467.90 |
+--------+------------+

/* ----------------------------------------------------------------------------- */

SELECT * FROM VENDEDORES;

+------------+----------+------+-----------+-----------+-----------+
| IDVENDEDOR | NOME     | SEXO | JANEIRO   | FEVEIRO   | MARÇO     |
+------------+----------+------+-----------+-----------+-----------+
|          1 | CARLOS   | M    |  76234.78 |  88346.87 |   5756.90 |
|          2 | MARIA    | F    |   5865.78 |   6768.87 |   4467.90 |
|          3 | ANTONIO  | M    |  78769.78 |   6685.87 |   6664.90 |
|          4 | CLARA    | F    |   5779.78 | 446886.88 |   8965.90 |
|          5 | ANDERSON | M    | 676545.75 |  77544.87 | 578665.88 |
|          6 | IVONE    | F    |  57789.78 |  44774.87 |  68665.90 |
|          7 | JOAO     | M    |   4785.78 |  66478.87 |   6887.90 |
|          8 | CELIA    | F    |  89667.78 |  57654.87 |   5755.90 |
+------------+----------+------+-----------+-----------+-----------+

/* ----------------------------------------------------------------------------- */

SELECT MIN(MARÇO) FROM VENDEDORES;

+-------------+
| MIN(MARÇO)  |
+-------------+
|     4467.90 |
+-------------+

/* ----------------------------------------------------------------------------- */

SELECT NOME, MARÇO FROM VENDEDORES
WHERE MARÇO = (SELECT MIN(MARÇO) FROM VENDEDORES);

+-------+---------+
| NOME  | MARÇO   |
+-------+---------+
| MARIA | 4467.90 |
+-------+---------+

/* ----------------------------------------------------------------------------- */

/* NOME E O VALOR QUE VENDEU MAIS EM MARÇO */

SELECT NOME, MARÇO FROM VENDEDORES
WHERE MARÇO = (SELECT MAX(MARÇO) FROM VENDEDORES);

+----------+-----------+
| NOME     | MARÇO     |
+----------+-----------+
| ANDERSON | 578665.88 |
+----------+-----------+

/* ----------------------------------------------------------------------------- */

SELECT NOME, MARÇO FROM VENDEDORES
WHERE MARÇO > (SELECT AVG(MARÇO) FROM VENDEDORES);

+----------+-----------+
| NOME     | MARÇO     |
+----------+-----------+
| ANDERSON | 578665.88 |
+----------+-----------+

/* ----------------------------------------------------------------------------- */

 /* QUEM VENDEU MAIS QUE O VALOR MEDIO DE FEVEREIRO */
 
SELECT NOME, FEVEIRO FROM VENDEDORES
WHERE FEVEIRO > (SELECT AVG(FEVEIRO) FROM VENDEDORES);

+-------+-----------+
| NOME  | FEVEREIRO |
+-------+-----------+
| CLARA | 446886.88 |
+-------+-----------+

/* ----------------------------------------------------------------------------- */

SELECT AVG(FEVEIRO) FROM VENDEDORES;

+---------------+
| AVG(FEVEREIRO)|
+---------------+
| 99392.744873  |
+---------------+

/* ----------------------------------------------------------------------------- */

SELECT NOME, FEVEIRO FROM VENDEDORES
WHERE FEVEIRO < (SELECT AVG(FEVEIRO) FROM VENDEDORES);

+----------+----------+
| NOME     | FEVEIRO  |
+----------+----------+
| CARLOS   | 88346.87 |
| MARIA    |  6768.87 |
| ANTONIO  |  6685.87 |
| ANDERSON | 77544.87 |
| IVONE    | 44774.87 |
| JOAO     | 66478.87 |
| CELIA    | 57654.87 |
+----------+----------+

/* ----------------------------------------------------------------------------- */








